using static Library;

Console.WriteLine("Задача 28: Напишите программу, которая принимает на вход число N и выдаёт произведение чисел от 1 до N.");

int n = GetNumber("Введите число N: ");
Console.WriteLine(GetResult(n));